Revit 2027 API
ValueAtPoint Methods
The ValueAtPoint type exposes the following members.
Methods
Name | Description
ClearAllFlags |  Sets flags for all measurements to ValueAtPointFlags::None.
(Inherited from ValueAtPointBase)
ClearFlagsAt |  Sets flags for the given measurement to ValueAtPointFlags::None.
(Inherited from ValueAtPointBase)
Dispose
(Inherited from ValueAtPointBase)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFlags |  Returns flags for the given measurement.
(Inherited from ValueAtPointBase)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetFlags(IList<Int32>) |  Independently sets the flags associated to all measurements.
(Inherited from ValueAtPointBase)
SetFlags(Int32) |  Sets the flags associated to all measurements to the same value.
(Inherited from ValueAtPointBase)
SetFlags(Int32, Int32) |  Sets the flags associated to a given measurement.
(Inherited from ValueAtPointBase)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ValueAtPoint Class
Autodesk.Revit.DB.Analysis Namespace